class Gamenotice extends React.Component{
  render(){
    let jump = Clips.staticUrl('/');
      return (
        <div className="notice">
            <h1>上网须知</h1>
			<div className="notice_content">
				派尔商业WIFI使用协议 欢迎您使用派尔商业WIFI上网服务，派尔商业WIFI由苏州派尔网络科技有限公司提供的无线上网服务，所有申请派尔商业WIFI上网的使用者，都应该详细阅读下列使用条款。下列使用条款订立的目的，是为保护苏州派尔网络科技有限公司及派尔WIFI用户的权益，并构成苏州派尔网络科技有限公司及派尔WIFI用户之间的契约： 派尔商业WIFI上网服务认知与接受条款
		<br />1. 派尔商业WIFI用户完成注册手续或开始使用苏州派尔网络科技有限公司所提供之服务时，即视为已阅读、了解并同意接受本使用条款及其他相关政策及规则之所有内容。  派尔商业WIFI用户均充分认知，派尔商业WIFI上网服务得按实际状况所需，苏州派尔网络科技有限公司有权随时修改或变更本使用条款之内容，并通过网站公告或以其他适当方式通知最新之约定事项。若您于任何修改或变更本使用条款后继续使用本服务，则视为您已阅读、了解并同意接受修改或变更，若您不同意时，您应立即停用本服务。  苏州派尔网络科技有限公司所提供之派尔商业WIFI上网服务仅属连线服务性质,如有连结他网之情况，相关知识产权属各该网站所有，且苏州派尔网络科技有限公司亦不担保资讯之正确与完整。 派尔商业WIFI用户除服务期间内按本须知及其他约定条款使用外,不得以任何方式将其权利移转、出租或出借予其他任何第三人，并不得在未经苏州派尔网络科技有限公司同意下，进行商业行为之利用，以维护所有派尔商业WIFI用户之使用安全。  派尔商业WIFI用户应充分认知，经由苏州派尔网络科技有限公司所取得之服务，涉及诸多整合科技，因此关于技术限制所致之派尔商业WIFI用户服务障碍，以及其他与苏州派尔网络科技有限公司无关之第三人行为或行为所可能引起之使用不便利，均应有充分认知。 派尔商业WIFI服务受距离及设备限制，供租对象为本公司采用产品技术可达之范围为限。以Wi-Fi连结网际网路时，其网路品质依国际标准归类为「best effort」模式，实际上网连线速率会因上网终端设备、距离、所在位置之环境及到访网站之连外频宽等因素之影响而有所变化。  派尔商业WIFI用户知悉网站(页)使用过程中，可能会接收部分赞助厂商、广告厂商之产品或服务讯息，而相关讯息之真实性与其文责等，派尔商业WIFI用户应自行独立理性判断。 <br />7. 派尔商业WIFI用户发生使用上问题应与交苏州派尔网络科技有限公司客服单位联络。 帐号、密码及安全性 <br />1. 您同意依本服务注册之资讯，提供您本人正确、最新及完整之资料。在取得派尔商业WIFI使用资格以前，必须经过完整注册手续，在注册过程中必须填入完整、且正确的资料以利确认，相关服务需经苏州派尔网络科技有限公司进行认证后生效。 <br />2. 若您提供任何错误、不实、过时或不完整之资料，或着苏州派尔网络科技有限公司有合理怀疑的理由怀疑资料有错误、不实、过时或不完整者，苏州派尔网络科技有限公司有权暂停或终止您的会员帐号服务，并拒绝您使用本服务之部分或全部功能。您应对于自行输入之个人使用者名称和密码所进行的所有行为，负完全之法律责任。 <br />3. 派尔商业WIFI用户应就使用者名称和密码，须负担妥善保管和保密的义务。如果发现或怀疑个人使用者名称和密码被其他人冒用、盗用或不当使用，应立即通知苏州派尔网络科技有限公司，以利苏州派尔网络科技有限公司尽快采取适当之因应措施。但上述因应措施不得因此解释为苏州派尔网络科技有限公司明示或默示对派尔商业WIFI用户负有任何形式之赔偿或补偿之责任或义务的免责条款，并且不得解释为苏州派尔网络科技有限公司愿意与派尔商业WIFI用户对第三人共同负担责任。 <br />4. 如因派尔商业WIFI用户对于使用者名称和密码之违约或违法使用，或怠于保管致遭冒用、盗用，以致于造成任何第三人对于苏州派尔网络科技有限公司主张损害或主张权利，苏州派尔网络科技有限公司有权要求派尔商业WIFI用户负担一切责任。苏州派尔网络科技有限公司基于检、警、调为调查犯罪之必要，依其来函要求提供一切可能涉及派尔商业WIFI用户包括但不限于个人资料予检、警、调。 资料隐私 <br />1. 苏州派尔网络科技有限公司为保护每一位派尔商业WIFI用户的隐私，不管是申请帐号或个人资料，除了可能涉及违法、侵权、违反本使用条款、经派尔商业WIFI用户同意或因政府行为以外，苏州派尔网络科技有限公司不会将派尔商业WIFI用户申请人之个人资料揭露或提供予第三人。 <br />2. 派尔商业WIFI网站(网页)中所提供之服务是苏州派尔网络科技有限公司提供，如果派尔商业WIFI用户不愿将个人资料揭露给其他合作伙伴，可选择不登录或使用无线上网及相关服务，但如明示同意或事实上已开始使用这些特定服务，派尔商业WIFI用户的个人资料即可能揭露给该服务之提供人。 <br />3. 在下列的情况下，苏州派尔网络科技有限公司有可能会查看或提供派尔商业WIFI用户的个人或相关电子讯息给相关政府机关或主张其权利受侵害并提出适当证明之第三人，必要时并得暂停本服务之全部或部分： <br />(1) 依法令规定、依司法机关或其他政府机关的命令或要求； <br />(2) 为执行本使用条款或使用者有违反本使用条款或其他相关政策及规则； <br />(3) 为保护其他使用者或其他第三人的合法权益； <br />(4) 为苏州派尔网络科技有限公司及其关联企业之系统安全或合法权益； <br />(5) 为维护苏州派尔网络科技有限公司本项服务系统之正常运作。 使用者行为 <br />1.任何未经事前授权的商业行为都是被禁止的。 <br />2.派尔商业WIFI用户必须遵守相关法令规范，并且对于经由派尔商业WIFI用户名称和密码所进行的任何行为、以及所储存的所有资料负责。 派尔商业WIFI用户必须同意不从事以下的行为： <br />(1) 传送任何违反中华人民共和国法令之邮件。 <br />(2) 重制、刊载、传输、发送、公开传输或储存任何侵害他人知识产权或其他法令的资料。 <br />(3) 未经同意收集他人电子邮件位址以及个人资料。 <br />(4) 重制、刊载、传输、发送、公开传输或储存任何诽谤、诈欺、虚伪买卖、伤害、猥亵、色情、赌博、犯罪行为或其他所有违反法令之邮件、档案或资料。 <br />(5) 未经同意擅自摘录或使苏州派尔网络科技有限公司服务内任何资料库内容之全部或部份内容。 <br />(6) 重制、刊载、传输、发送、公开传输、储存病毒、或其他任何足以破坏或干扰本项服务系统或资料的程式或电子讯息。 <br />(7) 传送幸运连锁信、垃圾邮件、广告信或其他漫无目的之邮件。 <br />(8) 破坏或干扰苏州派尔网络科技有限公司系统运作或违反一般网路礼节之行为。 <br />(9) 在未经授权下进入苏州派尔网络科技有限公司系统或与系统有关之网路、冒用或盗用他人帐号或伪造寄件人辨识资料传送邮件，企图误导收件人之判断。 <br />(10) 任何妨碍或干扰其他使用者使用之行为。 <br />(11) 任何透过不正当管道或手段窃取派尔商业WIFI用户帐号、密码或存取权限之行为。 <br />(12) 其他不符合本服务所提供的使用目的之行为。 <br />3.所有利用派尔商业WIFI用户服务所提供之电子邮件位址传送之邮件，均仅代表派尔商业WIFI用户的个人立场，且由使用者自行负担相关之风险,其利用行为不得有致使苏州派尔网络科技有限公司受有利益受损之虞。 知识产权声明与保护 <br />1. 派尔商业WIFI上网网站(页)及其连结本公司所提供之服务内所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由苏州派尔网络科技有限公司或其他权利人依法拥有其知识产权，包括但不限于商标权、专利权、著作权、营业秘密与专有技术等。 <br />2. 任何人不得径自使用、修改、重制、公开播送、改作、散布、发行、公开发表、进行还原工程、解编或反向组译。若您欲引用或转载前述软体、程式或网站内容，必须依法取得苏州派尔网络科技有限公司或其他权利人的事前书面同意。 <br />3.不论是否已经事前授权，派尔商业WIFI用户不可以将这些文字、图档、图片或其他著作或资料使用于： <br />(1) 销售、转让、出租、出借、转授权、搭售、赠与或其他任何形式的商业用途。 <br />(2) 上载于其他任何网站、或以其他方式提供予其他人使用。 <br />(3) 色情、侮辱、诽谤、非法交易、或其他不符著作权法或其他法令规定之行为。 <br />(4) 为上述使用目的所为之修改或编辑。 <br />(5) 如果任何文字、图档、图片或其他著作或资料发生权利归属或其他合法性争议，本公司有权随时不经通知，直接停止提供、删除、或通知派尔商业WIFI用户停止使用。 <br />4.尊重知识产权是派尔商业WIFI用户应尽的义务，如有违反，您应对苏州派尔网络科技有限公司负损害赔偿责任（包括但不限于诉讼费用及律师费用等）。 责任限制 <br />1. 本项服务仅依系统当时之功能及现况提供服务，派尔商业WIFI用户应自行评估了解各该服务之功能、限制与风险，决定是否使用。对于派尔商业WIFI用户之特定要求或需求，包括但不限于速度、安全性、可靠性、完整性、正确性及不会断线和出错等，苏州派尔网络科技有限公司不负任何形式或内容之担保或保证责任。 <br />2. 苏州派尔网络科技有限公司不保证任何邮件、档案或资料于传送过程均系可靠且正确无误，亦不保证所储存或所传送之邮件、档案或资料之安全性、可靠性、完整性、正确性及不会断线和出错等，派尔商业WIFI用户应对资料传送、储存失败、遗失或错误之邮件、档案或电子资讯、电脑系统损坏自负完全责任。派尔商业WIFI用户应自行评估了解各该服务之功能、限制与风险，决定是否使用。 <br />3.基于本项服务之技术与内容具有变异快速之特性，但相关硬体与其他经营方式、组织之调整有其客观上所需之过渡时期，故派尔商业WIFI用户应明白知悉即使系苏州派尔网络科技有限公司曾明白建议之注意事项，亦仅就「当时状况」所为，派尔商业WIFI用户仍应自行评估了解各该服务之功能、限制与风险，决定是否(继续)使用。苏州派尔网络科技有限公司对于所提供的派尔商业WIFI用户服务本身，因此所造成之任何直接或间接之损害均不负责。 服务暂停或中断 <br />1.在下列情形，苏州派尔网络科技有限公司将暂停或中断本服务之全部或部份，且对使用者任何直接或间接之损害，均不负任何责任： <br />(1)对本服务相关软硬体设备进行搬迁、更换、升级、保养或维修时。 <br />(2)使用者有任何违反政府法令或本使用条款情形。 <br />(3)天灾、地变、地震、停电、洪水、战争等不可抗力因素，致本服务系统障碍、停止、中断或不能执行业务。 <br />(4)其他情况变更或不可归责于苏州派尔网络科技有限公司之事由，包括但不限于政府行为所致之服务停止或中断。 <br />2. 苏州派尔网络科技有限公司系统或功能例行性之维护、改置或变动所发生之服务暂停或中断，苏州派尔网络科技有限公司将于服务暂停或中断前以网页公告或其他适当之方式告知派尔商业WIFI用户。 <br />3.因派尔商业WIFI用户违反相关法令或本使用条款、或依相关主管机关之要求、或因其他不可归责于苏州派尔网络科技有限公司之事由，而致系统或交通银行太平洋信用卡中心服务全部或部份暂停或中断时，均不负任何责任。 终止服务 <br />1.基于苏州派尔网络科技有限公司所无法掌握之情事变更（包括但不限于技术、干扰、政策、法令等因素），苏州派尔网络科技有限公司有可能停止提供网站(页)或服务之全部或一部，使用者不可以因此而要求任何赔偿或补偿。 <br />2.如果派尔商业WIFI用户违反了本使用条款或利用苏州派尔网络科技有限公司服务为不当、不法或犯罪之行为，苏州派尔网络科技有限公司可随时暂停或终止提供本服务之全部或部分，派尔商业WIFI用户不可以因此而要求任何赔偿或补偿。 <br />3.如果派尔商业WIFI用户于本服务重制、刊载、传输、发送或储存的邮件、档案或资料，有任何违反法令、违反本使用条款、或有侵害第三人权益之虞者，苏州派尔网络科技有限公司保留随时不经通知直接加以移动或删除之权利。若苏州派尔网络科技有限公司因此受到任何损失，派尔商业WIFI用户应对苏州派尔网络科技有限公司负损失赔偿之责。 <br />4.如果苏州派尔网络科技有限公司与网路服务提供商就本服务项目所签订之服务合约因故终止或无法续约致届满终止者，苏州派尔网络科技有限公司将于7天前以网站公告或以其他适当方式通知派尔商业WIFI用户，终止本服务。 派尔商业WIFI用户不可以因此而要求任何赔偿或补偿。 免责声明 <br />1.您明确了解并同意，苏州派尔网络科技有限公司不保证以下事项： <br />(1) 本服务将符合您的需求。 <br />(2)本服务不受干扰、及时提供或免于出错。 <br />(3) 派尔商业WIFI用户经由本服务购买或取得之任何产品、服务、资讯或其他资料将符合派尔商业WIFI用户的期望。 <br />(4)及时收到通知邮件。 <br />(5)未能即时查询或修改交易状况所引起之纠纷及损失。 <br />(6)未即时更新资料或以其他不正确不合法方式所产生之费用及损害。 <br />(7)所有会员自行填写资料之正确性。 <br />2.派尔商业WIFI用户经由本服务之使用下载或取得任何资料，如导致电脑系统或行动通讯装置之任何损坏或资料流失，除有可归责苏州派尔网络科技有限公司之情形外，苏州派尔网络科技有限公司不负责任。 <br />3. 派尔商业WIFI用户自本服务取得之建议和资讯，无论其为书面或口头，均不构成本服务之保证。 <br />4.除因苏州派尔网络科技有限公司故意或重大过失致派尔商业WIFI用户使用本服务产生损害者外，苏州派尔网络科技有限公司不负担任何违约或损害赔偿责任。 准据法及管辖权 <br />1.本使用条款之解释、补充及适用均以中华人民共和国法令为准据法。 其他约定事项 <br />1.本使用条款未约定之事项，依本项服务相关网页上所刊载之相关处理流程、相关说明及使用办法等定之；本项服务相关网页上所刊载之相关处理流程、说明、约定、使用办法、注意事项及限制等，均视为本使用条款之一部分。
			</div>

			<div className="footer">
	                <a href={jump}>跳过</a>
            </div>
        </div>
      )
  }
}

class Logo extends React.Component{
    render(){
        this.state = this.state || {};
        this.state.imgsrc = Clips.staticUrl('application/static/img/viewfile.png');
        return(
            <div className="logo">
                <img src={this.state.imgsrc}/>
                <p>
                    苏州派尔网络科技有限公司
                </p>
                <p className='labelFont'>
                    Wi-Fi设备型号98989998
                </p>
            </div>
        );
    }
}

class Copyright extends React.Component{
    render(){
        return(
            <div className="copyright">
                <p>苏州派尔网络科技许可及服务协议</p>
                <p>派尔网络科技有限公司 版权所有</p>
                <p>©Copyright Pinet Technology Solutions 2015</p>
            </div>
        )
    }
}

provides([Gamenotice,Logo,Copyright],'widgets',true);
